package ru.agiledev.wikiparser.parsers;

import org.junit.Test;
import ru.agiledev.wiki.domain.transformed.Word;

import java.util.List;

import static org.junit.Assert.assertNotNull;

/**
 * Created by a.kirillov
 * Date: 10/16/11 Time: 9:40 AM
 */
public class ArticleParserTest {

    @Test
    public void parseTest(){
        ArticleParser parser = new ArticleParser("банда");
        List<Word> words = parser.textToWordList(band);

        assertNotNull(words);

        parser = new ArticleParser("Банда");
        words = parser.textToWordList(Banda);

        assertNotNull(words);

    }


    String Banda = "{{Cf|банда}}\n" +
            "{{wikipedia}}\n" +
            "= {{-ru-}} =\n" +
            "\n" +
            "===Морфологические и синтаксические свойства===\n" +
            "{{сущ ru n ina 0\n" +
            "|основа=Ба́нда\n" +
            "|часть=Существительное\n" +
            "|слоги={{по-слогам|Ба́н|да}}\n" +
            "|show-text=1\n" +
            "}}\n" +
            "\n" +
            "Топоним.\n" +
            "\n" +
            "===Произношение===\n" +
            "{{transcriptions||}}\n" +
            "\n" +
            "===Семантические свойства===\n" +
            "====Значение====\n" +
            "# название одного из морей, относящихся к Тихому океану и омывающего ряд островов в Индонезии {{пример|}}\n" +
            "# название архипелага в составе Индонезии {{пример|Острова Банда.}}\n" +
            "# название города в индийском штате [[Уттар-Прадеш]] {{пример|}} \n" +
            "\n" +
            "====Синонимы====\n" +
            "# -\n" +
            "# \n" +
            "\n" +
            "====Антонимы====\n" +
            "# -\n" +
            "# \n" +
            "\n" +
            "====Гиперонимы====\n" +
            "# [[море]]\n" +
            "# [[остров]]а, [[архипелаг]]\n" +
            "\n" +
            "====Гипонимы====\n" +
            "# \n" +
            "# \n" +
            "\n" +
            "=== Родственные слова ===\n" +
            "{{родств-блок\n" +
            "|умласк=\n" +
            "|уничиж=\n" +
            "|увелич=\n" +
            "|имена-собственные=\n" +
            "|существительные=[[бандалезец]], [[бандалезка]] (названия жителей островов)\n" +
            "|прилагательные=[[бандалезский]]\n" +
            "|числительные=\n" +
            "|местоимения=\n" +
            "|глаголы=\n" +
            "|наречия=\n" +
            "|предикативы=\n" +
            "|предлоги=\n" +
            "}}\n" +
            "\n" +
            "===Этимология===\n" +
            "Происходит от {{этимология:}}\n" +
            "\n" +
            "===Перевод===\n" +
            "{{перев-блок||\n" +
            "|en=\n" +
            "|de=\n" +
            "|es=\n" +
            "|it=\n" +
            "|fr=\n" +
            "|uk=\n" +
            "|pl=\n" +
            "|la=\n" +
            "|el=\n" +
            "|bg=\n" +
            "|be=\n" +
            "}}\n" +
            "\n" +
            "[[Категория:Топонимы]]\n" +
            "\n" +
            "{{unfinished|p=1}}{{длина слова|5}}";

    String band = "{{Cf|Банда|джаз-банд}}\n" +
            "= {{-ru-}} =\n" +
            "\n" +
            "=== Морфологические и синтаксические свойства ===\n" +
            "{{сущ ru f ina 1a\n" +
            "|основа=ба́нд\n" +
            "|слоги={{по-слогам|ба́н|да}}\n" +
            "}}\n" +
            "\n" +
            "{{морфо||банд||а}}\n" +
            "\n" +
            "=== Произношение ===\n" +
            "{{transcriptions|ˈbandə|ˈbandɨ̞}}\n" +
            "\n" +
            "=== Семантические свойства ===\n" +
            "\n" +
            "==== Значение ====\n" +
            "# [[сообщество]] [[бандит]]ов, организованная преступная группа {{пример|}}\n" +
            "# вооруженный вражеский партизанский отряд {{пример|Белогвардейские банды.}} {{пример|Фашистские банды.}}\n" +
            "\n" +
            "==== Синонимы ====\n" +
            "# [[шайка]]; частичн.: [[ватага]]\n" +
            "# -\n" +
            "\n" +
            "==== Антонимы ====\n" +
            "# -\n" +
            "\n" +
            "==== Гиперонимы ====\n" +
            "# [[группа]], [[сообщество]]\n" +
            "# [[враг]]\n" +
            "\n" +
            "==== Гипонимы ====\n" +
            "# \n" +
            "\n" +
            "=== Родственные слова ===\n" +
            "{{родств-блок\n" +
            "|имена-собственные=\n" +
            "|существительные=[[бандит]], [[бандитизм]]\n" +
            "|прилагательные=[[бандитский]]\n" +
            "|глаголы=\n" +
            "|наречия=\n" +
            "}}\n" +
            "\n" +
            "=== Этимология ===\n" +
            "Происходит от\n" +
            "\n" +
            "=== Фразеологизмы и устойчивые сочетания ===\n" +
            "* \n" +
            "\n" +
            "=== Перевод ===\n" +
            "{{перев-блок||\n" +
            "|en=[[gang]]\n" +
            "|bg=[[банда]]\n" +
            "|de=[[Bande]] ''f'' =, -n, [[Gang]] {{transcription|gæŋ}} ''f'' =, -s\n" +
            "|eo=[[bando]]\n" +
            "}}\n" +
            "\n" +
            "= {{-bg-}} =\n" +
            "{{сущ bg 41|банд|слоги={{по-слогам|бан|.|да}}}}\n" +
            "\n" +
            "=== Произношение ===\n" +
            "{{transcription|}}\n" +
            "{{длина слова|5}}\n" +
            "{{длина слова|5|lang=bg}}\n" +
            "\n" +
            "=== Семантические свойства ===\n" +
            "==== Значение ====\n" +
            "# Аналогично русскому слову.\n" +
            "\n" +
            "==== Синонимы ====\n" +
            "# [[шайка]], [[чета]]\n" +
            "\n" +
            "=== Родственные слова ===\n" +
            "* существительные: [[бандит]], [[бандитизм]]\n" +
            "* прилагательные: [[бандитски]]\n" +
            "\n" +
            "=== Этимология ===\n" +
            "Аналогично русскому слову.\n" +
            "\n" +
            "[[Категория:Преступность]]\n" +
            "\n" +
            "[[bg:банда]]\n" +
            "[[en:банда]]\n" +
            "[[et:банда]]\n" +
            "[[fi:банда]]\n" +
            "[[fr:банда]]\n" +
            "[[sr:банда]]\n" +
            "[[uk:банда]]\n" +
            "[[vi:банда]]\n" +
            "[[zh:банда]]";
}
